---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BuildingpadThickness
source: html/e31e349f-222b-4b5e-748d-dd01c9ce6811.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BuildingpadThickness Property

"Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId BuildingpadThickness { get; }
```